Revit 2026 API

# DuctSettingsOvalDuctSizeSeparator Property

---

The oval duct size separator string.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string OvalDuctSizeSeparator { get; set; }
```
```vb
Public Property OvalDuctSizeSeparator As String
	Get
	Set
```
```cpp
public:
property String^ OvalDuctSizeSeparator {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member OvalDuctSizeSeparator : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

DuctSettings Class

Autodesk.Revit.DB.Mechanical Namespace